(None, 100, 300)
(None, 100, 300, 1)
Model: "model"
__________________________________________________________________________________________________
Layer (type)                    Output Shape         Param #     Connected to                     
==================================================================================================
input_1 (InputLayer)            [(None, 100)]        0                                            
__________________________________________________________________________________________________
embedding (Embedding)           (None, 100, 300)     53763000    input_1[0][0]                    
__________________________________________________________________________________________________
reshape (Reshape)               (None, 100, 300, 1)  0           embedding[0][0]                  
__________________________________________________________________________________________________
conv2d (Conv2D)                 (None, 98, 1, 512)   461312      reshape[0][0]                    
__________________________________________________________________________________________________
conv2d_1 (Conv2D)               (None, 97, 1, 512)   614912      reshape[0][0]                    
__________________________________________________________________________________________________
conv2d_2 (Conv2D)               (None, 96, 1, 512)   768512      reshape[0][0]                    
__________________________________________________________________________________________________
max_pooling2d (MaxPooling2D)    (None, 1, 1, 512)    0           conv2d[0][0]                     
__________________________________________________________________________________________________
max_pooling2d_1 (MaxPooling2D)  (None, 1, 1, 512)    0           conv2d_1[0][0]                   
__________________________________________________________________________________________________
max_pooling2d_2 (MaxPooling2D)  (None, 1, 1, 512)    0           conv2d_2[0][0]                   
__________________________________________________________________________________________________
concatenate (Concatenate)       (None, 3, 1, 512)    0           max_pooling2d[0][0]              
                                                                 max_pooling2d_1[0][0]            
                                                                 max_pooling2d_2[0][0]            
__________________________________________________________________________________________________
flatten (Flatten)               (None, 1536)         0           concatenate[0][0]                
__________________________________________________________________________________________________
dropout (Dropout)               (None, 1536)         0           flatten[0][0]                    
__________________________________________________________________________________________________
dense (Dense)                   (None, 20)           30740       dropout[0][0]                    
==================================================================================================
Total params: 55,638,476
Trainable params: 1,875,476
Non-trainable params: 53,763,000
__________________________________________________________________________________________________

